import matplotlib.pyplot as plt
from pylab import mpl

# 设置显示中文字体
# 字体需要额外下载安装，另外配置后需要去家目录cache清除缓存
mpl.rcParams["font.sans-serif"] = ["SimHei"]
# 设置正常显示符号
mpl.rcParams["axes.unicode_minus"] = False
def main():
    # 0.准备数据
    x = [225.98, 247.07, 253.14, 457.85, 241.58, 301.01, 20.67, 288.64,
         163.56, 120.06, 207.83, 342.75, 147.9, 53.06, 224.72, 29.51,
         21.61, 483.21, 245.25, 399.25, 343.35]
    y = [196.63, 203.88, 210.75, 372.74, 202.41, 247.61, 24.9, 239.34,
         140.32, 104.15, 176.84, 288.23, 128.79, 49.64, 191.74, 33.1,
         30.74, 400.02, 205.35, 330.64, 283.45]

    # 1.创建画布
    plt.figure(figsize=(20, 8), dpi=100)

    # 2.绘制散点图
    plt.scatter(x, y)

    # 3.显示图像
    plt.show()

if __name__ == '__main__':
    main()